import { useState } from 'react'
import styles from './Header.module.scss'
import { Link } from 'react-router-dom'
import { useAppSelector } from '../../hooks/hooks'

export const HeaderBlock = () => {
    
    const AuthRes = useAppSelector((state) => state.auth)

    const monthStr: string[] = ['Января', 'Февраля', 'Марта', 'Апреля', 'Мая', 'Июня', 'Июля', 'Августа', 'Сентября', 'Октября', 'Ноября', 'Декабря']
    const dayStr: string[] = ['Воскресенье', 'Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота']

    const [today, setToday] = useState<Date>(new Date())

    return (
        <header className={styles.header}>
            <div className={styles.wrapper}>
                <div className={styles.container}>
                    <Link to={'/'}>
                        <h1 className={styles.logo}><span className={styles.logoPrimary}>Dairy</span>Calendar</h1>
                    </Link>
                    <div className={styles.right}>
                        <div className={styles.btns}>
                            <button className={styles.notifications}>
                                <svg width="16" height="16" viewBox="0 0 14 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M9.54811 14.6667C9.54811 14.7845 9.50237 14.8976 9.42096 14.9809C9.33955 15.0643 9.22914 15.1111 9.114 15.1111H4.48358C4.36845 15.1111 4.25804 15.0643 4.17663 14.9809C4.09522 14.8976 4.04948 14.7845 4.04948 14.6667C4.04948 14.5488 4.09522 14.4357 4.17663 14.3524C4.25804 14.269 4.36845 14.2222 4.48358 14.2222H9.114C9.22914 14.2222 9.33955 14.269 9.42096 14.3524C9.50237 14.4357 9.54811 14.5488 9.54811 14.6667ZM13.463 12.2222C13.3752 12.3805 13.2478 12.5119 13.094 12.6031C12.9401 12.6942 12.7653 12.7417 12.5875 12.7407H1.01077C0.832724 12.7404 0.657922 12.6919 0.503981 12.6003C0.350039 12.5088 0.222398 12.3772 0.13392 12.219C0.0454417 12.0609 -0.000746772 11.8816 9.13117e-06 11.6993C0.000765035 11.517 0.0484385 11.3382 0.138225 11.1807C0.547005 10.4593 1.15547 8.42519 1.15547 5.77778C1.15547 4.24542 1.75003 2.77582 2.80836 1.69227C3.86669 0.608729 5.30209 0 6.79879 0C8.2955 0 9.7309 0.608729 10.7892 1.69227C11.8476 2.77582 12.4421 4.24542 12.4421 5.77778C12.4421 8.42444 13.0513 10.4593 13.4608 11.1807C13.5516 11.3385 13.5996 11.5181 13.6 11.7012C13.6004 11.8842 13.5531 12.0641 13.463 12.2222ZM12.7098 11.6296C12.1621 10.6667 11.5739 8.42074 11.5739 5.77778C11.5739 4.48116 11.0708 3.23766 10.1753 2.32081C9.27981 1.40397 8.06524 0.888889 6.79879 0.888889C5.53235 0.888889 4.31778 1.40397 3.42227 2.32081C2.52677 3.23766 2.02367 4.48116 2.02367 5.77778C2.02367 8.42148 1.43474 10.6667 0.887051 11.6296C0.874351 11.6522 0.867665 11.6777 0.867665 11.7037C0.867665 11.7297 0.874351 11.7553 0.887051 11.7778C0.898967 11.8005 0.916738 11.8194 0.938426 11.8324C0.960113 11.8455 0.984887 11.8522 1.01005 11.8519H12.5868C12.612 11.8522 12.6368 11.8455 12.6584 11.8324C12.6801 11.8194 12.6979 11.8005 12.7098 11.7778C12.7225 11.7553 12.7292 11.7297 12.7292 11.7037C12.7292 11.6777 12.7225 11.6522 12.7098 11.6296Z" fill="white" />
                                </svg>
                            </button>
                                <Link to={`/profile/${AuthRes.data?._id}`} className={styles.profile}>
                                    <svg width="20" height="20" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M13.1516 13.6314C12.8478 12.7809 12.1782 12.0293 11.2467 11.4933C10.3153 10.9572 9.17407 10.6667 8.00002 10.6667C6.82597 10.6667 5.68473 10.9572 4.75329 11.4933C3.82186 12.0293 3.15228 12.7809 2.84842 13.6314" stroke="white" strokeLinecap="round" />
                                        <ellipse cx="7.99998" cy="5.33335" rx="2.66667" ry="2.66667" stroke="white" strokeLinecap="round" />
                                    </svg>
                                </Link>
                        </div>
                        <div className={styles.today}>
                            <span className={styles.day}>{dayStr[today.getDay()]}</span>
                            <span className={styles.date}>{today.getDate()} {monthStr[today.getMonth()]} {today.getFullYear()}г.</span>
                        </div>
                    </div>
                </div>
            </div>
        </header>
    )
}
